Repository: Adil-Ashfaq35/tecno_qr
Catalog: lib/l10n/intl_*.arb
Languages: it, ur

source: Home
it: Homepage
ur: ہوم پیج

# history
source: Action Log
it: cronologia
ur: تاریخ

source: Language
it: La lingua
ur: زبان

source: FAQ
it: Domande frequenti
ur: اکثر پوچھے گئے سوالات

source: Privacy Policy
it: Informativa sulla privacy
ur: رازداری کی پالیسی

source: Terms of use
it: Condizioni d'uso
ur: استعمال کی شرائط

source: About
it: Informazioni su
ur: کے بارے میں

# scan_Button_Text
source: Scan From Camera
it: Scansione dalla fotocamera
ur: کیمرے سے اسکین کریں۔

# read_Button_Text
source: Read From Local Image
it: Leggere da un'immagine locale
ur: مقامی تصویر سے پڑھیں

# generate_Button_Text
source: Generate From Text
it: Generazione da testo
ur: متن سے پیدا کریں۔

# navigate_Button_Text
source: Navigate
it: Navigare
ur: نیویگیٹ کریں۔

# copy_Button_Text
source: Copy
it: Copia
ur: کاپی کریں۔

# result_Language_Label
source: Result
it: Risultato
ur: نتیجہ

# download_Button_Text
source: Download
it: Scaricare
ur: ڈاؤن لوڈ کریں

# share_Button_Text
source: Share
it: Condividere
ur: بانٹیں

# scan_Tree_Item
source: Scan Actions
it: Scansione della cronologia
ur: اسکین ہسٹری

# generate_Tree_item
source: Generate Actions
it: Genera cronologia
ur: تاریخ بنائیں

# first_Line
source: TecnoCode Version 6.0.1.0
it: TecnoCode LLC Versione 6.0.1.0
ur: Tecnocode ورژن 6.0.1.0

# second_Line
source: TecnoWays LLC All Rights Reserved
it: TecnoWays LLC Tutti i diritti riservati
ur: TecnoWays LLC تمام حقوق محفوظ ہیں۔

# oK_Button_Text
source: OK
ur: ٹھیک ہے

# cancel_Button_Text
source: Cancel
it: Annulla
ur: منسوخ کریں۔

# save_Button_Text
source: Save
it: Salva
ur: محفوظ کریں۔

# shown_Only_On_The_Early_First_Time
source: By installing or using this application you are accepting the privacy policy
it: Installando o utilizzando questa applicazione si accetta la versione inglese dell'informativa sulla privacy.
ur: اس ایپلی کیشن کو انسٹال یا استعمال کرکے آپ رازداری کی پالیسی کے انگریزی ورژن کو قبول کر رہے ہیں۔

source: Share App
it: Condividi app
ur: ایپ کا اشتراک کریں

source: Help
it: Aiuto
ur: مدد

# enter_Qr
source: Generate From Text
it: Inserisci Qr
ur: Qr درج کریں

source: Text
ur: متن

source: Paste
it: incolla
ur: پیسٹ

source: QR Code
ur: Qr کوڈ

# history_Screen
source: Action Log
it: Schermata cronologia
ur: ہسٹری سکرین

# qr_Not_Found_In_Image
source: No code detected in the image
it: Qr non trovato nell'immagine
ur: تصویر میں Qr نہیں ملا

# result_Screen
source: Result
it: Schermata dei risultati
ur: نتائج کی سکرین

# invalid_Url
source: Invalid Link
it: Url non valido
ur: غلط یو آر ایل

# result_Text_Type_Is_Not_Url_To_Navigate
source: Result Text type is not link to navigate
it: Il tipo di testo del risultato non è l'URL per navigare
ur: نتیجہ کے متن کی قسم نیویگیٹ کرنے کے لیے یو آر ایل نہیں ہے

source: Copied
it: Copiato
ur: کاپی شدہ

# read_History
source: Read Actions
it: Leggi cronologia
ur: تاریخ پڑھیں

# local_Permission_Alert
source: Local Storage Permission is Required
it: È richiesta l'autorizzazione di archiviazione locale
ur: مقامی اسٹوریج کی اجازت درکار ہے۔

# local_Alert_Description
source: Allow access to local storage to enable this feature or you can follow the following steps to use the application without permission: 1- Capture the QR Code image via your camera application or select a local image from your local files. 2- Share the image to TecnoCode application. 3- The result will be displayed directly in the TecnoCode application.
it: Consenti l'accesso alla memoria locale per abilitare questa funzione oppure puoi seguire i seguenti passaggi per utilizzare l'applicazione senza autorizzazione: 1- Cattura l'immagine del codice QR tramite l'applicazione della fotocamera o seleziona un'immagine locale dai tuoi file locali. 2- Condividi l'immagine con l'applicazione TecnoCode. 3- Il risultato verrà visualizzato direttamente nell'applicazione TecnoCode.
ur: اس خصوصیت کو فعال کرنے کے لیے مقامی اسٹوریج تک رسائی کی اجازت دیں یا آپ بغیر اجازت کے ایپلیکیشن کو استعمال کرنے کے لیے درج ذیل مراحل پر عمل کر سکتے ہیں: 1- اپنے کیمرہ ایپلیکیشن کے ذریعے کیو آر کوڈ کی تصویر کیپچر کریں یا اپنی مقامی فائلوں سے مقامی تصویر منتخب کریں۔ 2- تصویر کو ٹیکنو کوڈ ایپلیکیشن پر شیئر کریں۔ 3- نتیجہ براہ راست TecnoCode ایپلیکیشن میں دکھایا جائے گا۔

# camera_Permission_Alert
source: Camera Permission is Required
it: È richiesta l'autorizzazione alla fotocamera
ur: کیمرے کی اجازت درکار ہے۔

# camera_Alert_Description
source: Allow access to camera to enable this feature or you can follow the following steps to use the application without permission: 1- Capture the QR Code image via your camera application or select a local image from your local files. 2- Share the image to TecnoCode application. 3- The result will be displayed directly in the TecnoCode application.
it: Consenti l'accesso alla fotocamera per abilitare questa funzione oppure puoi seguire i seguenti passaggi per utilizzare l'applicazione senza autorizzazione: 1- Cattura l'immagine del codice QR tramite l'applicazione della fotocamera o seleziona un'immagine locale dai tuoi file locali. 2- Condividi l'immagine con l'applicazione TecnoCode. 3- Il risultato verrà visualizzato direttamente nell'applicazione TecnoCode.
ur: اس فیچر کو فعال کرنے کے لیے کیمرے تک رسائی کی اجازت دیں یا آپ بغیر اجازت کے ایپلیکیشن کو استعمال کرنے کے لیے درج ذیل اقدامات پر عمل کر سکتے ہیں: 1- اپنے کیمرہ ایپلیکیشن کے ذریعے کیو آر کوڈ کی تصویر کیپچر کریں یا اپنی مقامی فائلوں سے مقامی تصویر منتخب کریں۔ 2- تصویر کو ٹیکنو کوڈ ایپلیکیشن پر شیئر کریں۔ 3- نتیجہ براہ راست TecnoCode ایپلیکیشن میں دکھایا جائے گا۔

source: Grant Access
it: Concedere l'accesso
ur: رسائی فراہم کریں۔

source: Cancel
it: Annulla
ur: منسوخ کریں۔

# privacy_Policy_Confirmation
source: By installing or using this application you are accepting the
it: Installando o utilizzando questa applicazione si accetta la versione inglese dell'informativa sulla privacy.
ur: اس ایپلی کیشن کو انسٹال یا استعمال کرکے آپ رازداری کی پالیسی کے انگریزی ورژن کو قبول کر رہے ہیں۔

# camera_Permission_Cancel_Message_Button
source: Continue
it: Continua
ur: جاری رہے

source: No
ur: نہیں

source: Yes
it: sì
ur: جی ہاں

source: Are you sure?
it: Sei sicuro?
ur: کیا تمہیں یقین ہے؟

source: Do you want to exit this application
it: Vuoi uscire da questa applicazione
ur: کیا آپ اس ایپلیکیشن سے باہر نکلنا چاہتے ہیں؟

# third_Line
source: TecnoWays LLC All Rights Reserved
it: ©TecnoWays Tutti i diritti riservati
